In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {"Name":["sachin",'lakshay','saurabh','abhishek'],
       "Branch":["cse",'it','ece','cse'],
       "college":['piet','jecrc','raffels','piet'],
       "roll_no":[10,20,30,50]}
data

{'Name': ['sachin', 'lakshay', 'saurabh', 'abhishek'],
 'Branch': ['cse', 'it', 'ece', 'cse'],
 'college': ['piet', 'jecrc', 'raffels', 'piet'],
 'roll_no': [10, 20, 30, 50]}

In [3]:
pd.DataFrame(data)

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [5]:
df = pd.DataFrame(data)
df

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [6]:
type(df)

pandas.core.frame.DataFrame

In [8]:
type(df['Name']) # series   #in a data frame single column calles a series

pandas.core.series.Series

In [9]:
df['Branch'] # to access a single column

0    cse
1     it
2    ece
3    cse
Name: Branch, dtype: object

In [12]:
df.Name

0      sachin
1     lakshay
2     saurabh
3    abhishek
Name: Name, dtype: object

In [13]:
df.roll_no

0    10
1    20
2    30
3    50
Name: roll_no, dtype: int64

In [15]:
df[['Name','roll_no']] # to access a multiple column

       Name  roll_no
0    sachin       10
1   lakshay       20
2   saurabh       30
3  abhishek       50

In [16]:
df[['Branch','roll_no']]

  Branch  roll_no
0    cse       10
1     it       20
2    ece       30
3    cse       50

In [17]:
df

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [18]:
####___________FOR INDEXING IN DATAFRAME WE HAVE 2 METHOD :___________
#1.loc
#2.iloc

SyntaxError: invalid syntax (691121616.py, line 2)

In [19]:
df.iloc[2:4,2:4]

   college  roll_no
2  raffels       30
3     piet       50

In [20]:
df.iloc[-2:,-2:]

   college  roll_no
2  raffels       30
3     piet       50

In [21]:
df

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [23]:
df.loc[0:2] # in loc method the ending / stoping point are include

      Name Branch  college  roll_no
0   sachin    cse     piet       10
1  lakshay     it    jecrc       20
2  saurabh    ece  raffels       30

In [24]:
df.iloc[1:3,:3]

      Name Branch  college
1  lakshay     it    jecrc
2  saurabh    ece  raffels

In [26]:
df.iloc[-3:-1,-4:-1]

      Name Branch  college
1  lakshay     it    jecrc
2  saurabh    ece  raffels